<!DOCTYPE html>



  


<html class="theme-next pisces use-motion" lang="en">
<head><meta name="generator" content="Hexo 3.9.0">
  <meta charset="UTF-8">
<meta http-equiv="X-UA-Compatible" content="IE=edge">
<meta name="viewport" content="width=device-width, initial-scale=1, maximum-scale=1">
<meta name="theme-color" content="#222">









<meta http-equiv="Cache-Control" content="no-transform">
<meta http-equiv="Cache-Control" content="no-siteapp">
















  
  
  <link href="/lib/fancybox/source/jquery.fancybox.css?v=2.1.5" rel="stylesheet" type="text/css">







<link href="/lib/font-awesome/css/font-awesome.min.css?v=4.6.2" rel="stylesheet" type="text/css">

<link href="/css/main.css?v=5.1.4" rel="stylesheet" type="text/css">


  <link rel="apple-touch-icon" sizes="180x180" href="/images/apple-touch-icon-next.png?v=5.1.4">


  <link rel="icon" type="image/png" sizes="32x32" href="/images/favicon-32x32-next.png?v=5.1.4">


  <link rel="icon" type="image/png" sizes="16x16" href="/images/favicon-16x16-next.png?v=5.1.4">


  <link rel="mask-icon" href="/images/logo.svg?v=5.1.4" color="#222">





  <meta name="keywords" content="windows病毒分析,">










<meta name="description" content="目标通过样本继续熟悉WinDbg工具的使用和内核恶意代码的行为  驱动加载过程 Rootkit技术之挂钩SSDT表 蓝屏分析 清除带有驱动的恶意代码 Rootkit技术之进程隐藏  流程 基础静态分析 高级静态动态结合分析  实践过程实例1Lab10-02.exe 基础静态分析Lab10-02.exe1.根据”CreateServiceA”和”ntoskrnl.exe”以及sys后缀的文件名，得出">
<meta name="keywords" content="windows病毒分析">

<li><p>验证替换结果，”dd dwo KeServiceDescriptorTable L100”，查看SSDT表项内容，可以明显看到异于其他地址的项，也确实是样本中被替换的函数位置</p>
<p><img src="/2019/10/24/windows样本高级动态分析四/1571989179669.png" alt="1571989179669"></p>
</li>
</ol>
<h3 id="小结"><a href="#小结" class="headerlink" title="小结"></a>小结</h3><p>该样本虽然HOOK成功了，但是在win7 32位虚拟机中并不能实现隐藏文件的恶意行为，在调试的过程中，打开文件夹等操作并不一定可以触发HOOK函数，而即使触发了，并且完成了替换结构体”FILE_BOTH_DIR_INFORMATION”也依然可以看见目录下的文件，在网上搜索后发现应该是需要HOOK “ZwQueryDirectoryFile”函数来实现隐藏，有环境的同学可以自己编译代码来测试一下。</p>
<p>清除主机上的样本：删除服务的注册表项即可，如果遇到”LEGACY_486_WS_DRIVER”项，可以借助<strong>psexec</strong>工具为regedit工具提升到system权限即可：”psexec -i -d -s c:\windows\regedit.exe”</p>
<h2 id="实例2"><a href="#实例2" class="headerlink" title="实例2"></a>实例2</h2><p>Lab10-03.exe</p>
<p>Lab10-03.sys</p>
<h3 id="基础静态分析-1"><a href="#基础静态分析-1" class="headerlink" title="基础静态分析"></a>基础静态分析</h3><h4 id="Lab10-03-exe"><a href="#Lab10-03-exe" class="headerlink" title="Lab10-03.exe"></a>Lab10-03.exe</h4><ol>
<li>创建驱动服务实现对设备的读写操作</li>
<li>存在网页链接但是没有网络API，所以初步断定为COM组件实现的联网行为</li>
</ol>
<pre><code>导入函数：
CreateServiceA
StartServiceA
DeviceIoControl
OleUninitialize
CoCreateInstance

字符串：
\\.\ProcHelper
C:\Windows\System32\Lab10-03.sys
http://www.malwareanalysisbook.com/ad.html</code></pre><h4 id="Lab10-03-sys"><a href="#Lab10-03-sys" class="headerlink" title="Lab10-03.sys"></a>Lab10-03.sys</h4><p>创建设备对象”\Device\ProcHelper”以及设备对象的符号链接链接”\DosDevices\ProcHelper”供内核中使用，<code>\\.\ProcHelper</code>供用户态应用程序访问</p>
<pre><code>导入函数：
IofCompleteRequest
IoDeleteDevice
IoCreateSymbolicLink
IoCreateDevice

字符串：
\DosDevices\ProcHelper
\Device\ProcHelper</code></pre><h3 id="高级动态静态结合分析-1"><a href="#高级动态静态结合分析-1" class="headerlink" title="高级动态静态结合分析"></a>高级动态静态结合分析</h3><p>首先是Lab10-03.exe，为”C:\Windows\System32\Lab10-03.sys”驱动文件创建驱动服务”Process Helper”，开启服务来加载驱动，随后关闭该服务。并且该加载驱动只限于首次创建，后续由于没有删除服务所以不会在这里开启该服务</p>
<p><img src="/2019/10/24/windows样本高级动态分析四/1572232933190.png" alt="1572232933190"></p>
<p>这一步很奇怪，打开设备对象的符号链接，进行I/O操作但是并没有输入输出数据，这里暂时留个疑问，接着看下去</p>
<p><img src="/2019/10/24/windows样本高级动态分析四/1572235321340.png" alt="1572235321340"></p>
<p>创建”IWebBrowser2”接口的COM对象，接着访问偏移为0x2C位置的函数，并传入参数”<a href="http://www.malwareanalysisbook.com/ad.html&quot;，所以我们这里根据引入结构体来识别偏移位置的函数为&quot;IWebBrowser2Vtbl.Navigate&quot;，启用IE浏览器来访问该网页" target="_blank" rel="noopener">http://www.malwareanalysisbook.com/ad.html&quot;，所以我们这里根据引入结构体来识别偏移位置的函数为&quot;IWebBrowser2Vtbl.Navigate&quot;，启用IE浏览器来访问该网页</a></p>
<p><img src="/2019/10/24/windows样本高级动态分析四/1572235780631.png" alt="1572235780631"></p>
<p>接着我们看一下驱动文件具体做了哪些行为。</p>
<ol>
<li><p>创建设备对象”\Device\ProcHelper”</p>
</li>
<li><p>给驱动对象添加MajorFunction主函数表中赋了3个函数(偏移为：0、2、E)以及卸载函数的赋值，这一步可以根据”dt nt!_DRIVER_OBJECT”来查看驱动对象结构图，发现主函数表位置刚好是偏移0x38处，卸载函数位置刚好是0x34位置处。</p>
<p>并且我们查询”wdm.h”中这个头文件可以知道：偏移为0的函数对应IRP_MJ_CREATE请求，2对应IRP_MJ_CLOSE，0xE对应IRP_MJ_DEVICE_CONTROL</p>
</li>
<li><p>创建驱动对象的符号链接来让用户空间的程序可以访问到设备对象</p>
</li>
<li><p>删除设备对象</p>
</li>
</ol>
<p><img src="/2019/10/24/windows样本高级动态分析四/1572237121512.png" alt="1572237121512"></p>
<pre><code>2: kd&gt; dt nt!_DRIVER_OBJECT
   +0x000 Type             : Int2B
   +0x002 Size             : Int2B
   +0x004 DeviceObject     : Ptr32 _DEVICE_OBJECT
   +0x008 Flags            : Uint4B
   +0x00c DriverStart      : Ptr32 Void
   +0x010 DriverSize       : Uint4B
   +0x014 DriverSection    : Ptr32 Void
   +0x018 DriverExtension  : Ptr32 _DRIVER_EXTENSION
   +0x01c DriverName       : _UNICODE_STRING
   +0x024 HardwareDatabase : Ptr32 _UNICODE_STRING
   +0x028 FastIoDispatch   : Ptr32 _FAST_IO_DISPATCH
   +0x02c DriverInit       : Ptr32     long 
   +0x030 DriverStartIo    : Ptr32     void 
   +0x034 DriverUnload     : Ptr32     void 
   +0x038 MajorFunction    : [28] Ptr32     long </code></pre><p>wdm.h头文件</p>
<pre><code class="c">#define IRP_MJ_CREATE                   0x00
#define IRP_MJ_CREATE_NAMED_PIPE        0x01
#define IRP_MJ_CLOSE                    0x02
#define IRP_MJ_READ                     0x03
....
#define IRP_MJ_DEVICE_CONTROL           0x0e</code></pre>
<p>这里我们分析不同IRP请求对应的处理函数内容。</p>
<p>首先是IRP_MJ_CREATE和IRP_MJ_CLOSE请求，这里只是告诉系统已经完成了处理请求的操作，属于正常行为</p>
<p><img src="/2019/10/24/windows样本高级动态分析四/1572246726664.png" alt="1572246726664"></p>
<p>IRP_MJ_DEVICE_CONTROL，当用户模式下DeviceIoControl调用或者内核模式ZwDeviceIoControlFile调用时发送请求包时，有该函数进行处理，结合上面一个很奇怪的DeviceIoControl调用，我们可以断定和这里的处理函数有关。</p>
<p>调用IoGetCurrentProcess获取一个指针指向当前进程，内部实际上是调用的PsGetCurrentProcess ，最终这个返回的指针是一个指向一个未公布的结构体<em>EPROCESS</em>，具体怎么分析出这个结构体的可以参考【4】。</p>
<p><img src="/2019/10/24/windows样本高级动态分析四/1572247768559.png" alt="1572247768559"></p>
<p>随后我们win7 32位平台上双击调试得出的这个结构体中我们看到了各个偏移对应的字段，但是并没有找到偏移88和8C对应的内容，这里是应该是xp系统中才会有的偏移，下面我们还是参照xp系统对应的结构来分析</p>
<pre><code>2: kd&gt; dt nt!_eprocess
   +0x000 Pcb              : _KPROCESS
   +0x098 ProcessLock      : _EX_PUSH_LOCK
   +0x0a0 CreateTime       : _LARGE_INTEGER
   +0x0a8 ExitTime         : _LARGE_INTEGER
   +0x0b0 RundownProtect   : _EX_RUNDOWN_REF
   +0x0b4 UniqueProcessId  : Ptr32 Void
   +0x0b8 ActiveProcessLinks : _LIST_ENTRY</code></pre><p>xp中，我们可以看见在这个结构体偏移0x88处是一个_LIST_ENTRY类型数据，这个类型是一个双向链表结构体，通过该双向链表来讲所有进程组成一个进程链</p>
<p><img src="/2019/10/24/windows样本高级动态分析四/1572337088616.png" alt="1572337088616"></p>
<pre><code>typedef struct _LIST_ENTRY {
struct _LIST_ENTRY *Flink; // 指向下一个节点
struct _LIST_ENTRY *Blink; // 指向前一个节点
} LIST_ENTRY, *PLIST_ENTRY;</code></pre><p>再了解到该出数据类型后，我们可以分析出上面汇编代码的含义（下面进程的Flink，Blink指代进程ActiveProcessLinks的Flink，Blink）：</p>
<h4 id="Rootkit之隐藏进程"><a href="#Rootkit之隐藏进程" class="headerlink" title="Rootkit之隐藏进程"></a>Rootkit之隐藏进程</h4><p>上一个进程的Flink的地址赋给ecx</p>
<pre><code class="assembly">mov     ecx, [eax+8Ch]</code></pre>
<p>下一个进程的Flink的地址赋给edx</p>
<pre><code class="assembly">add     eax, 88h    ;当前进程Flink的地址
mov     edx, [eax]</code></pre>
<p>将下一个进程的Flink地址赋值给上一个进程的Flink，也就是让<strong>上一个进程的Flink指向下一个进程的双向链表而绕过当前进程的双向链表</strong></p>
<pre><code class="assembly">mov     [ecx], edx</code></pre>
<p>下一个进程的Flink的地址赋给ecx</p>
